fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ДоговарНаОбслуживание</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацииУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
    Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Установите период обслуживания'"), , "Объект.Период");
		Возврат;
    КонецЕсли;
    
    Объект.ТабличнаяЧасть.Очистить();
    
	ДлительнаяОперация = ЗаполнениеТаблицыНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеТаблицыЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнениеТаблицыЗавершение(Результат,ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда  
		
		Данные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Для Каждого Элемента Из Данные Цикл
			
		    НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
	        НоваяСтрока.ДоговарНаОбслуживание = Элемента.ключ;
	        Если Элемента.Значение = Неопределено тогда
	              НоваяСтрока.РеализацииУслуг = Элемента.ключ;
	        Иначе
	        	 НоваяСтрока.РеализацииУслуг = Элемента.значение;
	        КонецЕсли;	 
		КонецЦикла;
		
		Текст = "Выполнено";
		СообщитьПользователю(Текст);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ЗаполнениеТаблицыНаСервере()
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
	"Обработки.ВКМ_МассовоеСозданиеАктов.ЗаполнениеТаблицы",Объект.Период);   
	
	Возврат ДлительнаяОперация;
	

КонецФункции

&НаСервереБезКонтекста
Процедура  СообщитьПользователю(Текст) 
	ОбщегоНазначения.СообщитьПользователю(Текст); 
КонецПроцедуры

#КонецОбласти
